Secret have been created:

```bash
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_secret_manager_secret.build_cluster_secrets["k8s-release-bug-triage-github-token"] will be created
  + resource "google_secret_manager_secret" "build_cluster_secrets" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + labels      = {
          + "group" = "sig-release"
        }
      + name        = (known after apply)
      + project     = "k8s-infra-prow-build-trusted"
      + secret_id   = "k8s-release-bug-triage-github-token"

      + replication {
          + automatic = true
        }
    }

  # google_secret_manager_secret_iam_binding.build_cluster_secret_admins["k8s-release-bug-triage-github-token"] will be created
  + resource "google_secret_manager_secret_iam_binding" "build_cluster_secret_admins" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + members   = [
          + "group:k8s-infra-prow-oncall@kubernetes.io",
          + "group:k8s-infra-release-editors@kubernetes.io",
        ]
      + project   = "k8s-infra-prow-build-trusted"
      + role      = "roles/secretmanager.admin"
      + secret_id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
google_secret_manager_secret.build_cluster_secrets["k8s-release-bug-triage-github-token"]: Creating...
google_secret_manager_secret.build_cluster_secrets["k8s-release-bug-triage-github-token"]: Creation complete after 1s [id=projects/k8s-infra-prow-build-trusted/secrets/k8s-release-bug-triage-github-token]
google_secret_manager_secret_iam_binding.build_cluster_secret_admins["k8s-release-bug-triage-github-token"]: Creating...
google_secret_manager_secret_iam_binding.build_cluster_secret_admins["k8s-release-bug-triage-github-token"]: Creation complete after 5s [id=projects/k8s-infra-prow-build-trusted/secrets/k8s-release-bug-triage-github-token/roles/secretmanager.admin]
````